# 대학교 정보
## 일반대학, 교육대학, 전문대학, 특수학교 데이터 포함
### 데이터 출처 
    - https://kosis.kr/statHtml/statHtml.do?orgId=101&tblId=DT_1YL21181

In [ ]:
import pandas as pd

In [7]:
uni=pd.read_csv("C:\\Users\\owner\\team project\\대학교_수_시도_시_군_구__20230418143625.csv",encoding="EUC-KR",header=1)

In [8]:
uni.head()

,행정구역별,대학교 수<br>(A+B+C+D),대학교 수<br>(A+B+C+D).1,대학교 수<br>(A+B+C+D).2,대학교 수<br>(A+B+C+D).3,대학교 수<br>(A+B+C+D).4
0,서울특별시,48,48,48,48,48
1,종로구,3,3,3,3,3
2,중구,2,2,2,2,2
3,용산구,1,1,1,1,1
4,성동구,2,2,2,2,2

In [9]:
# 컬럼 이름바꾸기
uni.columns=["자치구별","2018년도대학교수","2019년도대학교수","2020년도대학교수","2021년도대학교수","2022년도대학교수"]

In [ ]:
uni["자치구별"]

In [11]:
uni.head()

    자치구별  2018년도대학교수  2019년도대학교수  2020년도대학교수  2021년도대학교수  2022년도대학교수
0  서울특별시          48          48          48          48          48
1    종로구           3           3           3           3           3
2     중구           2           2           2           2           2
3    용산구           1           1           1           1           1
4    성동구           2           2           2           2           2

In [19]:
# 자치구별 컬럼 인덱스로 변경
uni.set_index("자치구별",inplace=True)

In [20]:
university=uni

In [ ]:
# 필요없는 데이터 제거
university.drop("서울특별시",inplace=True)

In [24]:
university()

TypeError: 'DataFrame' object is not callable

In [26]:
university.to_csv("C:\\Users\\owner\\team project\\전처리 완\\university.csv")